In [4]:
n # 데이터 URL을 변수 data_url에 넣기
data_url = 'https://archive.ics.uci.edu/ml/machine-learningdatabases/housing/housing.data'
# csv 데이터 로드
df_data = pd.read_csv(data_url, sep='\s+', header = None)
df = pd.DataFrame(df_data)
df

NameError: name 'n' is not defined

In [6]:
pd_l = [1, 2, 3, 4, 5]
pd_data1 = pd.DataFrame(pd_l)
pd_data1

NameError: name 'pd' is not defined

In [7]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [8]:
import pandas as pd

In [9]:
from pandas import Series

In [10]:
pd_l = [1, 2, 3, 4, 5]
pd_data1 = pd.DataFrame(pd_l)
pd_data1

   0
0  1
1  2
2  3
3  4
4  5

In [11]:
type(pd_data1)

pandas.core.frame.DataFrame

In [12]:
pd_data1['1열']=pd_l
pd_data1

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [14]:
pd_name = ['a', 'b'. 'c', 'd', 'e']
pd_data1['이름']=pd_name
pd_data1

SyntaxError: invalid syntax (257853168.py, line 1)

In [15]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
'age': [42, 52, 36, 24, 73],
'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [17]:
pd_name = ['a', 'b', 'c', 'd', 'e']
pd_data1['이름']=pd_name
pd_data1

   0  1열 이름
0  1   1  a
1  2   2  b
2  3   3  c
3  4   4  d
4  5   5  e

In [18]:
pd_data1.columns

Index([0, '1열', '이름'], dtype='object')

In [21]:
pd_data2=pd_data1.rename(columns={0:'0열'})
pd_data2

   0열  1열 이름
0   1   1  a
1   2   2  b
2   3   3  c
3   4   4  d
4   5   5  e

In [24]:
score = [["정약용", 70, 80, 100],
        ["이순신", 100, 80, 70],
        ["이율곡", 90, 95, 90]
        ]

In [26]:
score = [["정약용", 70, 80, 100],
        ["이순신", 100, 80, 70],
        ["이율곡", 90, 95, 90]
        ]

In [27]:
score = [["정약용", 70, 80, 100],
        ["이순신", 100, 80, 70],
        ["이율곡", 90, 95, 90]
        ]
score

[['정약용', 70, 80, 100], ['이순신', 100, 80, 70], ['이율곡', 90, 95, 90]]

In [28]:
type(score)

list

In [29]:
score_df = pd.DataFrame(score)
score_df

     0    1   2    3
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [30]:
score_df.columns = ['성명', '국어', '영어', '수학']
score_df

    성명   국어  영어   수학
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [31]:
score_df_temp = score_df.rename(columns = {'국어':'korean', '영어':'english'})
score_df_temp

    성명  korean  english   수학
0  정약용      70       80  100
1  이순신     100       80   70
2  이율곡      90       95   90

### 딕셔너리를 DataFrame으로 만들기

In [33]:
score_dic = {'성명' : ["정약용","이순신","이율곡"],
             '국어' : [70, 80, 100],
             '영어' : [100, 80, 70],
             '수학' : [90, 95, 90]
            }
score_dic

{'성명': ['정약용', '이순신', '이율곡'],
 '국어': [70, 80, 100],
 '영어': [100, 80, 70],
 '수학': [90, 95, 90]}

In [34]:
type(score_dic)

dict

In [35]:
score_dic_df = pd.DataFrame(score_dic)
score_dic_df

    성명   국어   영어  수학
0  정약용   70  100  90
1  이순신   80   80  95
2  이율곡  100   70  90

In [36]:
score_dic_df.values

array([['정약용', 70, 100, 90],
       ['이순신', 80, 80, 95],
       ['이율곡', 100, 70, 90]], dtype=object)

In [37]:
score_dic_df.index = score_dic_df['성명']
score_dic_df

      성명   국어   영어  수학
성명
정약용  정약용   70  100  90
이순신  이순신   80   80  95
이율곡  이율곡  100   70  90

In [38]:
score_dic_df.drop(['성명'], axis = 1)

      국어   영어  수학
성명
정약용   70  100  90
이순신   80   80  95
이율곡  100   70  90

In [39]:
score_dic_df.drop(['이순신'], axis = 0)

      성명   국어   영어  수학
성명
정약용  정약용   70  100  90
이율곡  이율곡  100   70  90

In [41]:
score_dic_df.drop(['성명'], axis=1, inplace=True)
score_dic_df

      국어   영어  수학
성명
정약용   70  100  90
이순신   80   80  95
이율곡  100   70  90